src/cf/Enums/уатРазделыПланирования.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>уатРазделыПланирования</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ВыработкаТСпоПЛ</Name>
					<Comment>(не используется) Выработка ТС по путевым листам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыработкаТСпоМЛ</Name>
					<Comment>(не используется) Выработка ТС по маршрутным листам</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПредоставленныеУслуги</Name>
					<Comment>Предоставленные услуги</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выработка</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоходыРасходы</Name>
					<Comment>Доходы и Расходы</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОбъемыПеревозок</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Аренда</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РемонтыИТО</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказыНаЖДПеревозки</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/cf/Enums/уатРазделыПланирования/Ext/ManagerModule.bsl
#Область ОбработчикиСобытий

Процедура ОбработкаПолученияДанныхВыбора(ДанныеВыбора, Параметры, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	ДанныеВыбора = Новый СписокЗначений();
	ДанныеВыбора.Добавить(Перечисления.уатРазделыПланирования.Выработка);
	ДанныеВыбора.Добавить(Перечисления.уатРазделыПланирования.ПредоставленныеУслуги);
	ДанныеВыбора.Добавить(Перечисления.уатРазделыПланирования.ДоходыРасходы);
	Если ПолучитьФункциональнуюОпцию("уатИспользоватьЗакреплениеМаршрутныхЛистовЗаПеревозчиками_уэ") Тогда
		ДанныеВыбора.Добавить(Перечисления.уатРазделыПланирования.ОбъемыПеревозок);
	КонецЕсли;
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиТакси()
		И ПолучитьФункциональнуюОпцию("такИспользоватьАрендуТС") Тогда
		ДанныеВыбора.Добавить(Перечисления.уатРазделыПланирования.Аренда);
	КонецЕсли;
	Если уатОбщегоНазначенияПовтИсп.ВариантПоставкиКОРП() И ПолучитьФункциональнуюОпцию("уатИспользоватьЖДПеревозки") Тогда
		ДанныеВыбора.Добавить(Перечисления.уатРазделыПланирования.ЗаказыНаЖДПеревозки);
	КонецЕсли;
	ДанныеВыбора.Добавить(Перечисления.уатРазделыПланирования.РемонтыИТО);

КонецПроцедуры

#КонецОбласти
